/* Отримайте у користувача число(N) від якого ми будемо складати.
Отримати число можна за допомогою prompt. */

let numberN = +prompt('Введіть перше ціле число:', '');

// Перевірте, чи є передане значення N ЦІЛИМ числом.

while(true) {
  if (Number.isInteger(numberN) && numberN != ''){
    break;
  } else {
    numberN = +prompt('Ви помилилися, введіть перше число:', '');
  }
}
console.log(parseInt(numberN));


/* Отримайте у користувача число(M) до якого ми будемо складати
(включно). Отримати число можна за допомогою prompt. */

let numberM = +prompt('Введіть друге ціле число, яке більше за попереднє:', '');

// Перевірте, чи є передане значення N ЦІЛИМ числом.

while(true) {
  if (Number.isInteger(numberM) && numberM != '' && numberM > numberN){
    break;
  } else {
    numberM = +prompt('Ви помилилися, введіть друге число:', '');
  }
}
console.log(parseInt(numberM));


/* Отримайте у користувача булевий параметр(true/false), який 
підкаже нам чи потрібно пропускати парні числа. TRUE – потрібно,
FALSE – не потрібно. Використовуйте функцію confirm */

skipEvenNumbers = confirm('Пропускати парні числа при додаванні?');
console.log(skipEvenNumbers);

/* Напишіть цикл, який буде складати числа від раніше отриманих
N та M. В циклі додайте перевірку – чи потрібно пропускати при складанні парні числа. 
(Використовуйте для цього if/else). Якщо парні числа потрібно пропускати не додавайте їх до суми. */

let sum = 0;

for (let i = numberN; i <= numberM; i++) {
  if (skipEvenNumbers && i % 2 === 0) {
    continue;
  }
  sum += i;
}

document.writeln(`Сума чисел: ${sum}`);